mobizt/Firebase-ESP-Client/src/sslclient/esp8266/ESP8266_SSL_Client.cpp

/**
 *
 * The Network Upgradable BearSSL Client Class, ESP8266_SSL_Client.cpp v2.0.0
 *
 * Created July 20, 2022
 *
 * This works based on Earle F. Philhower ServerSecure class
 *
 * The MIT License (MIT)
 * Copyright (c) 2022 K. Suwatchai (Mobizt)
 *
 *
 * Permission is hereby granted, free of charge, to any person returning a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
  WiFiClientBearSSL- SSL client/server for esp8266 using BearSSL libraries
  - Mostly compatible with Arduino WiFi shield library and standard
    WiFiClient/ServerSecure (except for certificate handling).

  Copyright (c) 2018 Earle F. Philhower, III

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef ESP8266_SSL_Client_CPP
#define ESP8266_SSL_Client_CPP

#if defined(ESP8266)

#include "ESP8266_SSL_Client.h"

void ESP8266_SSL_Client::m_clear()
{

    ssl_client_ctx = nullptr;
    ssl_server_ctx = nullptr;

    eng = nullptr;

    x509_minimal = nullptr;
    x509_insecure = nullptr;
    x509_knownkey = nullptr;

    ssl_iobuf_in = nullptr;
    ssl_iobuf_out = nullptr;

    now = 0; // You can override or ensure time() is correct w/configTime
    ta = nullptr;
    setBufferSizes(16384, 512); // Minimum safe
    handshake_done = false;
    recvapp_buf = nullptr;
    recvapp_len = 0;
    oom_err = false;
    tls_session = nullptr;

    cipher_list = nullptr;

    cipher_cnt = 0;
    tls_version_min = BR_TLS10;
    tls_version_max = BR_TLS12;
}

ESP8266_SSL_Client::ESP8266_SSL_Client()
{
    m_clear();
    m_clearAuthenticationSettings();
    certStore = nullptr; // Don't want to remove cert store on a clear, should be long lived
    sk = nullptr;
    stack_thunk_add_ref();
}

ESP8266_SSL_Client::~ESP8266_SSL_Client()
{
    if (base_client)
    {
        if (base_client->connected())
            base_client->stop();
        base_client = nullptr;
    }
    cipher_list = nullptr;
    m_freeSSL();
    stack_thunk_del_ref();
}

void ESP8266_SSL_Client::setClientRSACert(const BearSSL_X509List *chain, const BearSSL_PrivateKey *sk)
{
    this->chain = chain;
    this->sk = sk;
}

void ESP8266_SSL_Client::setClientECCert(const BearSSL_X509List *chain, const BearSSL_PrivateKey *sk, unsigned allowed_usages, unsigned cert_issuer_key_type)
{
    this->chain = chain;
    this->sk = sk;
    this->allowed_usages = allowed_usages;
    this->cert_issuer_key_type = cert_issuer_key_type;
}

void ESP8266_SSL_Client::setBufferSizes(int recv, int xmit)
{
    // Following constants taken from bearssl/src/ssl/ssl_engine.c (not exported unfortunately)
    const int ESP8266_SSL_CLIENT_MAX_OUT_OVERHEAD = 85;
    const int ESP8266_SSL_CLIENT_MAX_IN_OVERHEAD = 325;

    // The data buffers must be between 512B and 16KB
    recv = std::max(512, std::min(16384, recv));
    xmit = std::max(512, std::min(16384, xmit));

    // Add in overhead for SSL protocol
    recv += ESP8266_SSL_CLIENT_MAX_IN_OVERHEAD;
    xmit += ESP8266_SSL_CLIENT_MAX_OUT_OVERHEAD;
    ssl_iobuf_in_size = recv;
    ssl_iobuf_out_size = xmit;
}

void ESP8266_SSL_Client::stop()
{

    if (base_client)
        base_client->stop();

    if (!secured)
        return;

    // Only if we've already connected, store session params and clear the connection options
    if (handshake_done)
    {
        if (tls_session)
        {
            br_ssl_engine_get_session_parameters(eng, tls_session->getSession());
        }
    }

    m_freeSSL();
}

void ESP8266_SSL_Client::flush()
{
    if (!base_client)
        return;

    if (secured)
        (void)m_run_until(BR_SSL_SENDAPP);

    base_client->flush();
}

int ESP8266_SSL_Client::connect(IPAddress ip, uint16_t port)
{
    if (!base_client)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF((const char *)FPSTR("Client is not yet initialized\n"));
        return false;
    }

    if (!base_client->connect(ip, port))
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("connect: base client connection failed\n");
        return false;
    }

    return true;
}

bool ESP8266_SSL_Client::connect(const char *name, uint16_t port)
{
    if (!base_client)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF((const char *)FPSTR("Client is not yet initialized\n"));
        return false;
    }

    if (!base_client->connect(name, port))
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("connect: base client connection failed\n");
        return false;
    }

    return true;
}

