mobizt/Firebase-ESP-Client/src/sslclient/esp8266/ESP8266_SSL_Client.cpp
int ESP8266_SSL_Client::connect(const String &host, uint16_t port)
{
    return connect(host.c_str(), port);
}

void ESP8266_SSL_Client::m_freeSSL()
{
    // These are smart pointers and will free if refcnt==0
    ssl_client_ctx = nullptr;
    ssl_server_ctx = nullptr;

    x509_minimal = nullptr;
    x509_insecure = nullptr;
    x509_knownkey = nullptr;

    ssl_iobuf_in = nullptr;
    ssl_iobuf_out = nullptr;

    // Reset non-allocated ptrs (pointing to bits potentially free'd above)
    recvapp_buf = nullptr;
    recvapp_len = 0;

    // This connection is toast
    handshake_done = false;
    timeout = 15000;
    secured = false;
}

bool ESP8266_SSL_Client::m_clientConnected()
{
    return (base_client && base_client->connected());
}

bool ESP8266_SSL_Client::connected()
{
    if (!base_client)
        return false;

    if (!secured)
        return base_client->connected();

    if (available() || (m_clientConnected() && handshake_done && (br_ssl_engine_current_state(eng) != BR_SSL_CLOSED)))
    {
        return true;
    }
    return false;
}

int ESP8266_SSL_Client::availableForWrite()
{
    if (!base_client || !secured)
        return 0;

    // code taken from ::_write()
    if (!connected() || !handshake_done)
    {
        return 0;
    }
    // Get BearSSL to a state where we can send
    if (m_run_until(BR_SSL_SENDAPP) < 0)
    {
        return 0;
    }
    if (br_ssl_engine_current_state(eng) & BR_SSL_SENDAPP)
    {
        size_t sendapp_len;
        (void)br_ssl_engine_sendapp_buf(eng, &sendapp_len);
        // We want to call br_ssl_engine_sendapp_ack(0) but 0 is forbidden (bssl doc).
        // After checking br_ssl_engine_sendapp_buf() src code,
        // it seems that it is OK to not call ack when the buffer is left untouched.
        // forbidden: br_ssl_engine_sendapp_ack(_eng, 0);
        return (int)sendapp_len;
    }
    return 0;
}

size_t ESP8266_SSL_Client::m_write(const uint8_t *buf, size_t size, bool pmem)
{

    if (!base_client)
        return 0;

    if (!secured)
    {
        if (pmem)
        {
            char dest[size];
            memcpy_P((void *)dest, (PGM_VOID_P)buf, size);
            return base_client->write((uint8_t *)dest, size);
        }

        return base_client->write(buf, size);
    }

    size_t sent_bytes = 0;

    if (!connected() || !size || !handshake_done)
    {
        return 0;
    }

    do
    {
        // Ensure we yield if we need multiple fragments to avoid WDT
        if (sent_bytes)
        {
            optimistic_yield(1000);
        }

        // Get BearSSL to a state where we can send
        if (m_run_until(BR_SSL_SENDAPP) < 0)
        {
            break;
        }

        if (br_ssl_engine_current_state(eng) & BR_SSL_SENDAPP)
        {
            size_t sendapp_len;
            unsigned char *sendapp_buf = br_ssl_engine_sendapp_buf(eng, &sendapp_len);
            int to_send = size > sendapp_len ? sendapp_len : size;

            if (pmem)
            {
                memcpy_P(sendapp_buf, buf, to_send);
            }
            else
            {
                memcpy(sendapp_buf, buf, to_send);
            }

            br_ssl_engine_sendapp_ack(eng, to_send);
            br_ssl_engine_flush(eng, 0);
            flush();
            buf += to_send;
            sent_bytes += to_send;
            size -= to_send;
        }
        else
        {
            break;
        }
    } while (size);

    return sent_bytes;
}

size_t ESP8266_SSL_Client::write(const uint8_t *buf, size_t size)
{
    return m_write(buf, size, false);
}

size_t ESP8266_SSL_Client::write_P(PGM_P buf, size_t size)
{
    return m_write((const uint8_t *)buf, size, true);
}

size_t ESP8266_SSL_Client::write(Stream &stream)
{
    if (!connected() || !handshake_done)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("write: Connect/handshake not completed yet\n");
        return 0;
    }

    size_t dl = stream.available();
    uint8_t buf[dl];
    stream.readBytes(buf, dl);
    return m_write(buf, dl, false);
}

int ESP8266_SSL_Client::read(uint8_t *buf, size_t size)
{
    if (!base_client)
        return 0;

    if (!secured)
        return base_client->read(buf, size);

    if (!handshake_done)
    {
        return -1;
    }

    int avail = available();
    bool conn = connected();
    if (!avail && conn)
    {
        return 0; // We're still connected, but nothing to read
    }
    if (!avail && !conn)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("read: Not connected, none left available\n");
        return -1;
    }

    if (avail)
    {
        // Take data from the recvapp buffer
        int to_copy = recvapp_len < size ? recvapp_len : size;
        memcpy(buf, recvapp_buf, to_copy);
        br_ssl_engine_recvapp_ack(eng, to_copy);
        recvapp_buf = nullptr;
        recvapp_len = 0;
        return to_copy;
    }

    if (!conn)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("read: Not connected\n");
        return -1;
    }
    return 0; // If we're connected, no error but no read.
}

// return a pointer to available data buffer (size = peekAvailable())
// semantic forbids any kind of read() before calling peekConsume()
const char *ESP8266_SSL_Client::peekBuffer()
{
    return (const char *)recvapp_buf;
}

// consume bytes after use (see peekBuffer)
void ESP8266_SSL_Client::peekConsume(size_t consume)
{
    br_ssl_engine_recvapp_ack(eng, consume);
    recvapp_buf = nullptr;
    recvapp_len = 0;
}

int ESP8266_SSL_Client::read()
{
    if (!base_client)
        return -1;

    if (!secured)
        return base_client->read();

    uint8_t c;
    if (1 == read(&c, 1))
    {
        return c;
    }
    MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("read: failed\n");
    return -1;
}

int ESP8266_SSL_Client::available()
{
    if (!base_client)
        return 0;

    if (!secured)
        return base_client->available();

    if (recvapp_buf)
    {
        return recvapp_len; // Anything from last call?
    }
    recvapp_buf = nullptr;
    recvapp_len = 0;
    if (m_run_until(BR_SSL_RECVAPP, false) < 0)
    {
        return 0;
    }

