mobizt/Firebase-ESP-Client/src/sslclient/esp8266/ESP8266_SSL_Client.cpp
    int st = br_ssl_engine_current_state(eng);
    if (st == BR_SSL_CLOSED)
    {
        return 0; // Nothing leftover, SSL is closed
    }

    if (st & BR_SSL_RECVAPP)
    {
        recvapp_buf = br_ssl_engine_recvapp_buf(eng, &recvapp_len);
        return recvapp_len;
    }

    return 0;
}

int ESP8266_SSL_Client::peek()
{
    if (!available())
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("peek: Not connected, none left available\n");
        return -1;
    }

    if (!secured)
        return base_client->peek();

    if (recvapp_buf && recvapp_len)
    {
        return recvapp_buf[0];
    }
    MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("peek: No data left\n");
    return -1;
}

size_t ESP8266_SSL_Client::peekBytes(uint8_t *buffer, size_t length)
{
    if (!base_client || !secured)
        return 0;

    size_t to_copy = 0;

    startMillis = millis();
    while ((available() < (int)length) && ((millis() - startMillis) < 5000))
    {
        yield();
    }

    to_copy = recvapp_len < length ? recvapp_len : length;
    memcpy(buffer, recvapp_buf, to_copy);
    return to_copy;
}

/* --- Copied almost verbatim from BEARSSL SSL_IO.C ---
   Run the engine, until the specified target state is achieved, or
   an error occurs. The target state is SENDAPP, RECVAPP, or the
   combination of both (the combination matches either). When a match is
   achieved, this function returns 0. On error, it returns -1.
*/

int ESP8266_SSL_Client::m_run_until(unsigned int target, bool blocking)
{

    esp8266::polledTimeout::oneShotMs loopTimeout(timeout);

    for (int no_work = 0; blocking || no_work < 2;)
    {
        optimistic_yield(100);

        if (loopTimeout)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_run_until: Timeout\n");
            return -1;
        }

        int state;
        state = br_ssl_engine_current_state(eng);
        if (state & BR_SSL_CLOSED)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_run_until: BSSL closed\n");
            return -1;
        }

        if (!(base_client->connected()) && !base_client->available())
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_run_until: not connected\n");
            return (state & target) ? 0 : -1;
        }

        /*
           If there is some record data to send, do it. This takes
           precedence over everything else.
        */
        if (state & BR_SSL_SENDREC)
        {
            unsigned char *buf;
            size_t len;
            int wlen;

            buf = br_ssl_engine_sendrec_buf(eng, &len);

#if defined(ESP8266_CORE_SDK_V3_X_X)
            size_t availForWrite = base_client->availableForWrite();

            if (!blocking && len > availForWrite)
            {
                /*
                   writes on WiFiClient will block if len > availableForWrite()
                   this is needed to prevent available() calls from blocking
                   on dropped connections
                */
                len = availForWrite;
            }
#endif
            wlen = base_client->write(buf, len);

            if (wlen <= 0)
            {
                /*
                   If we received a close_notify and we
                   still send something, then we have our
                   own response close_notify to send, and
                   the peer is allowed by RFC 5246 not to
                   wait for it.
                */
                return -1;
            }

            if (wlen > 0)
            {
                br_ssl_engine_sendrec_ack(eng, wlen);
            }

            no_work = 0;
            continue;
        }

        /*
           If we reached our target, then we are finished.
        */
        if (state & target)
        {
            return 0;
        }

        /*
           If some application data must be read, and we did not
           exit, then this means that we are trying to write data,
           and that's not possible until the application data is
           read. This may happen if using a shared in/out buffer,
           and the underlying protocol is not strictly half-duplex.
           This is unrecoverable here, so we report an error.
        */
        if (state & BR_SSL_RECVAPP)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_run_until: Fatal protocol state\n");
            return -1;
        }

        /*
           If we reached that point, then either we are trying
           to read data and there is some, or the engine is stuck
           until a new record is obtained.
        */
        if (state & BR_SSL_RECVREC)
        {
            if (base_client->available())
            {
                unsigned char *buf;
                size_t len;
                int rlen;

                buf = br_ssl_engine_recvrec_buf(eng, &len);

                int read = 0;
                int toRead = len;
                while (toRead > 0 && base_client->available())
                {
                    rlen = base_client->read(buf + read, toRead);
                    read += rlen;
                    toRead = len - read;
                    delay(0);
                    if (loopTimeout)
                    {
                        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_run_until: Timeout\n");
                        return -1;
                    }
                }

                rlen = read;

                if (rlen < 0)
                {
                    return -1;
                }

                if (rlen > 0)
                {
                    br_ssl_engine_recvrec_ack(eng, rlen);
                }

                no_work = 0;
                continue;
            }
        }

        /*
           We can reach that point if the target RECVAPP, and
           the state contains SENDAPP only. This may happen with
           a shared in/out buffer. In that case, we must flush
           the buffered data to "make room" for a new incoming
           record.
        */
        br_ssl_engine_flush(eng, 0);

        no_work++; // We didn't actually advance here
    }
    // We only get here if we ran through the loop without getting anything done
    return -1;
}

bool ESP8266_SSL_Client::m_wait_for_handshake()
{
    handshake_done = false;

    // Change waiting time out to ensure the handshake done
    unsigned long to = timeout;
    timeout = 15000;
    while (!handshake_done && m_clientConnected())
    {
        int ret = m_run_until(BR_SSL_SENDAPP);
        if (ret < 0)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_wait_for_handshake: failed\n");
            break;
        }
        if (br_ssl_engine_current_state(eng) & BR_SSL_SENDAPP)
        {
            handshake_done = true;
        }
        optimistic_yield(1000);
    }

    // Restore waiting time out
    timeout = to;
    return handshake_done;
}

// Set a fingerprint by parsing an ASCII string
bool ESP8266_SSL_Client::setFingerprint(const char *fpStr)
{
    int idx = 0;
    uint8_t c, d;
    uint8_t fp[20];

    while (idx < 20)
    {
        c = pgm_read_byte(fpStr++);
        if (!c)
            break; // String ended, done processing
        d = pgm_read_byte(fpStr++);
        if (!d)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("setFingerprint: FP too short\n");
            return false; // Only half of the last hex digit, error
        }
        c = mb_htoi(c);
        d = mb_htoi(d);
        if ((c > 15) || (d > 15))
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("setFingerprint: Invalid char\n");
            return false; // Error in one of the hex characters
        }
        fp[idx++] = (c << 4) | d;

        // Skip 0 or more spaces or colons
        while (pgm_read_byte(fpStr) && (pgm_read_byte(fpStr) == ' ' || pgm_read_byte(fpStr) == ':'))
        {
            fpStr++;
        }
    }
    if ((idx != 20) || pgm_read_byte(fpStr))
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("setFingerprint: Garbage at end of fp\n");
        return false; // Garbage at EOL or we didn't have enough hex digits
    }
    return setFingerprint(fp);
}

// Set custom list of ciphers
bool ESP8266_SSL_Client::setCiphers(const uint16_t *cipherAry, int cipherCount)
{
    cipher_list = nullptr;
    cipher_list = std::shared_ptr<uint16_t>(new (std::nothrow) uint16_t[cipherCount], std::default_delete<uint16_t[]>());
    if (!cipher_list.get())
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("setCiphers: list empty\n");
        return false;
    }
    memcpy_P(cipher_list.get(), cipherAry, cipherCount * sizeof(uint16_t));
    cipher_cnt = cipherCount;
    return true;
}

bool ESP8266_SSL_Client::setCiphersLessSecure()
{
    return setCiphers(mb_bearssl_faster_suites_P, sizeof(mb_bearssl_faster_suites_P) / sizeof(mb_bearssl_faster_suites_P[0]));
}

bool ESP8266_SSL_Client::setCiphers(const std::vector<uint16_t> &list)
{
    return setCiphers(&list[0], list.size());
}

