mobizt/Firebase-ESP-Client/src/sslclient/esp8266/ESP8266_SSL_Client.cpp
bool ESP8266_SSL_Client::setSSLVersion(uint32_t min, uint32_t max)
{
    if (((min != BR_TLS10) && (min != BR_TLS11) && (min != BR_TLS12)) ||
        ((max != BR_TLS10) && (max != BR_TLS11) && (max != BR_TLS12)) ||
        (max < min))
    {
        return false; // Invalid options
    }
    tls_version_min = min;
    tls_version_max = max;
    return true;
}

// Installs the appropriate X509 cert validation method for a client connection
bool ESP8266_SSL_Client::m_installClientX509Validator()
{

    if (use_insecure || use_fingerprint || use_self_signed)
    {
        // Use common insecure x509 authenticator
        x509_insecure = std::make_shared<struct mb_br_x509_insecure_context>();
        if (!x509_insecure)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("installClientX509Validator: OOM for x509_insecure\n");
            return false;
        }
        m_br_x509_insecure_init(x509_insecure.get(), use_fingerprint, fingerprint, use_self_signed);
        br_ssl_engine_set_x509(eng, &x509_insecure->vtable);
    }
    else if (knownkey)
    {
        // Simple, pre-known public key authenticator, ignores cert completely.
        x509_knownkey = std::make_shared<br_x509_knownkey_context>();
        if (!x509_knownkey)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("installClientX509Validator: OOM for x509_knownkey\n");
            return false;
        }
        if (knownkey->isRSA())
        {
            br_x509_knownkey_init_rsa(x509_knownkey.get(), knownkey->getRSA(), knownkey_usages);
        }
        else if (knownkey->isEC())
        {
#ifndef BEARSSL_SSL_BASIC
            br_x509_knownkey_init_ec(x509_knownkey.get(), knownkey->getEC(), knownkey_usages);
#else
            (void)knownkey;
            (void)knownkey_usages;
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("installClientX509Validator: Attempting to use EC keys in minimal cipher mode (no EC)\n");
            return false;
#endif
        }
        br_ssl_engine_set_x509(eng, &x509_knownkey->vtable);
    }
    else
    {
        // X509 minimal validator.  Checks dates, cert chain for trusted CA, etc.
        x509_minimal = std::make_shared<br_x509_minimal_context>();
        if (!x509_minimal)
        {
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("installClientX509Validator: OOM for x509_minimal\n");
            return false;
        }
        br_x509_minimal_init(x509_minimal.get(), &br_sha256_vtable, ta ? ta->getTrustAnchors() : nullptr, ta ? ta->getCount() : 0);
        br_x509_minimal_set_rsa(x509_minimal.get(), br_ssl_engine_get_rsavrfy(eng));
#ifndef BEARSSL_SSL_BASIC
        br_x509_minimal_set_ecdsa(x509_minimal.get(), br_ssl_engine_get_ec(eng), br_ssl_engine_get_ecdsa(eng));
#endif
        mb_bearssl_br_x509_minimal_install_hashes(x509_minimal.get());
        if (now)
        {
            // Magic constants convert to x509 times
            br_x509_minimal_set_time(x509_minimal.get(), ((uint32_t)now) / 86400 + 719528, ((uint32_t)now) % 86400);
        }
        if (certStore)
        {
            certStore->installCertStore(x509_minimal.get());
        }
        br_ssl_engine_set_x509(eng, &x509_minimal->vtable);
    }
    return true;
}

std::shared_ptr<unsigned char> ESP8266_SSL_Client::m_alloc_iobuf(size_t sz)
{
    // Allocate buffer with preference to IRAM
#if defined(ESP8266_CORE_SDK_V3_X_X)
    HeapSelectIram primary;
    auto sptr = std::shared_ptr<unsigned char>(new (std::nothrow) unsigned char[sz], std::default_delete<unsigned char[]>());
    if (!sptr)
    {
        HeapSelectDram alternate;
        sptr = std::shared_ptr<unsigned char>(new (std::nothrow) unsigned char[sz], std::default_delete<unsigned char[]>());
    }
    return sptr;
#else
    return std::shared_ptr<unsigned char>(new unsigned char[sz], std::default_delete<unsigned char[]>());
#endif
}

// Called by connect() to do the actual SSL setup and handshake.
// Returns if the SSL handshake succeeded.
bool ESP8266_SSL_Client::m_connectSSL(const char *hostName)
{
    if (!base_client)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF((const char *)FPSTR("Client is not yet initialized\n"));
        return false;
    }

    if (!m_clientConnected())
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF((const char *)FPSTR("Client is not connected\n"));
        return false;
    }

    MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSL: start connection\n");

#ifdef MB_ESP8266_SSLCLIENT_ENABLE_DEBUG
    // BearSSL will reject all connections unless an authentication option is set, warn in DEBUG builds
    if (!this->use_insecure && !this->use_fingerprint && !this->use_self_signed && !this->knownkey && !this->certStore && !this->ta)
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("Connection *will* fail, no authentication method is setup\n");
    }
#endif

    ssl_client_ctx = std::make_shared<br_ssl_client_context>();
    eng = &ssl_client_ctx->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    ssl_iobuf_in = m_alloc_iobuf(ssl_iobuf_in_size);
    ssl_iobuf_out = m_alloc_iobuf(ssl_iobuf_out_size);

    if (!ssl_client_ctx || !ssl_iobuf_in || !ssl_iobuf_out)
    {
        this->m_freeSSL();
        oom_err = true;
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSL: OOM error\n");
        return false;
    }
    // If no cipher list yet set, use defaults
    if (!cipher_list)
    {
        mb_br_ssl_client_base_init(ssl_client_ctx.get(), mb_suites_P, sizeof(mb_suites_P) / sizeof(mb_suites_P[0]));
    }
    else
    {
        mb_bearssl_br_ssl_client_base_init(ssl_client_ctx.get(), this->cipher_list.get(), this->cipher_cnt);
    }

    // Only failure possible in the installation is OOM
    if (!m_installClientX509Validator())
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSL: Can't install x509 validator\n");
        return false;
    }

    br_ssl_engine_set_buffers_bidi(eng, ssl_iobuf_in.get(), ssl_iobuf_in_size, ssl_iobuf_out.get(), ssl_iobuf_out_size);
    br_ssl_engine_set_versions(eng, tls_version_min, tls_version_max);

    // Apply any client certificates, if supplied.
    if (this->sk && this->sk->isRSA())
    {
        br_ssl_client_set_single_rsa(ssl_client_ctx.get(), this->chain ? this->chain->getX509Certs() : nullptr, this->chain ? this->chain->getCount() : 0, sk->getRSA(), br_rsa_pkcs1_sign_get_default());
    }
    else if (this->sk && this->sk->isEC())
    {
#ifndef BEARSSL_SSL_BASIC
        br_ssl_client_set_single_ec(ssl_client_ctx.get(), this->chain ? this->chain->getX509Certs() : nullptr, this->chain ? this->chain->getCount() : 0, this->sk->getEC(), allowed_usages, cert_issuer_key_type, br_ec_get_default(), br_ecdsa_sign_asn1_get_default());
#else
        m_freeSSL();
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSL: Attempting to use EC cert in minimal cipher mode (no EC)\n");
        return false;
#endif
    }

    // Restore session from the storage spot, if present
    if (tls_session)
    {
        br_ssl_engine_set_session_parameters(eng, tls_session->getSession());
    }

    if (!br_ssl_client_reset(ssl_client_ctx.get(), hostName, tls_session ? 1 : 0))
    {
        m_freeSSL();
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSL: Can't reset client\n");
        return false;
    }

    auto ret = m_wait_for_handshake();

    // Session is already validated here, there is no need to keep following
    x509_minimal = nullptr;
    x509_insecure = nullptr;
    x509_knownkey = nullptr;

    secured = ret;

    return ret;
}

