mobizt/Firebase-ESP-Client/src/sslclient/esp8266/ESP8266_SSL_Client.cpp
// Slightly different X509 setup for servers who want to validate client
// certificates, so factor it out as it's used in RSA and EC servers.
bool ESP8266_SSL_Client::m_installServerX509Validator(const BearSSL_X509List *client_CA_ta)
{
    if (client_CA_ta)
    {
        ta = client_CA_ta;
        // X509 minimal validator.  Checks dates, cert chain for trusted CA, etc.
        x509_minimal = std::make_shared<br_x509_minimal_context>();
        if (!x509_minimal)
        {
            m_freeSSL();
            oom_err = true;
            MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("installServerX509Validator: OOM for x509_minimal\n");
            return false;
        }
        br_x509_minimal_init(x509_minimal.get(), &br_sha256_vtable, ta->getTrustAnchors(), ta->getCount());
        br_ssl_engine_set_default_rsavrfy(eng);
#ifndef BEARSSL_SSL_BASIC
        br_ssl_engine_set_default_ecdsa(eng);
#endif
        br_x509_minimal_set_rsa(x509_minimal.get(), br_ssl_engine_get_rsavrfy(eng));
#ifndef BEARSSL_SSL_BASIC
        br_x509_minimal_set_ecdsa(x509_minimal.get(), br_ssl_engine_get_ec(eng), br_ssl_engine_get_ecdsa(eng));
#endif
        mb_bearssl_br_x509_minimal_install_hashes(x509_minimal.get());
        if (now)
        {
            // Magic constants convert to x509 times
            br_x509_minimal_set_time(x509_minimal.get(), ((uint32_t)now) / 86400 + 719528, ((uint32_t)now) % 86400);
        }
        br_ssl_engine_set_x509(eng, &x509_minimal->vtable);
        br_ssl_server_set_trust_anchor_names_alt(ssl_server_ctx.get(), ta->getTrustAnchors(), ta->getCount());
    }
    return true;
}

// Called by WiFiServerBearSSL when an RSA cert/key is specified.
bool ESP8266_SSL_Client::m_connectSSLServerRSA(const BearSSL_X509List *chain, const BearSSL_PrivateKey *sk, BearSSL_ServerSessions *cache, const BearSSL_X509List *client_CA_ta)
{
    m_freeSSL();
    oom_err = false;

    ssl_server_ctx = std::make_shared<br_ssl_server_context>();
    eng = &ssl_server_ctx->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    ssl_iobuf_in = m_alloc_iobuf(ssl_iobuf_in_size);
    ssl_iobuf_out = m_alloc_iobuf(ssl_iobuf_out_size);

    if (!ssl_server_ctx || !ssl_iobuf_in || !ssl_iobuf_out)
    {
        m_freeSSL();
        oom_err = true;
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerRSA: OOM error\n");
        return false;
    }

    mb_bearssl_br_ssl_server_base_init(ssl_server_ctx.get(), mb_bearssl_suites_server_rsa_P, sizeof(mb_bearssl_suites_server_rsa_P) / sizeof(mb_bearssl_suites_server_rsa_P[0]));
    br_ssl_server_set_single_rsa(ssl_server_ctx.get(), chain ? chain->getX509Certs() : nullptr, chain ? chain->getCount() : 0,
                                 sk ? sk->getRSA() : nullptr, BR_KEYTYPE_KEYX | BR_KEYTYPE_SIGN,
                                 br_rsa_private_get_default(), br_rsa_pkcs1_sign_get_default());
    br_ssl_engine_set_buffers_bidi(eng, ssl_iobuf_in.get(), ssl_iobuf_in_size, ssl_iobuf_out.get(), ssl_iobuf_out_size);
    br_ssl_engine_set_versions(eng, tls_version_min, tls_version_max);
    if (cache != nullptr)
        br_ssl_server_set_cache(ssl_server_ctx.get(), cache->getCache());
    if (client_CA_ta && !m_installServerX509Validator(client_CA_ta))
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerRSA: Can't install serverX509check\n");
        return false;
    }
    if (!br_ssl_server_reset(ssl_server_ctx.get()))
    {
        m_freeSSL();
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerRSA: Can't reset server ctx\n");
        return false;
    }

    return m_wait_for_handshake();
}

// Called by WiFiServerBearSSL when an elliptic curve cert/key is specified.
bool ESP8266_SSL_Client::m_connectSSLServerEC(const BearSSL_X509List *chain, unsigned cert_issuer_key_type, const BearSSL_PrivateKey *sk, BearSSL_ServerSessions *cache, const BearSSL_X509List *client_CA_ta)
{
#ifndef BEARSSL_SSL_BASIC
    m_freeSSL();
    oom_err = false;

    ssl_server_ctx = std::make_shared<br_ssl_server_context>();
    eng = &ssl_server_ctx->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    ssl_iobuf_in = m_alloc_iobuf(ssl_iobuf_in_size);
    ssl_iobuf_out = m_alloc_iobuf(ssl_iobuf_out_size);

    if (!ssl_server_ctx || !ssl_iobuf_in || !ssl_iobuf_out)
    {
        m_freeSSL();
        oom_err = true;
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerEC: OOM error\n");
        return false;
    }

    mb_bearssl_br_ssl_server_base_init(ssl_server_ctx.get(), mb_bearssl_suites_server_ec_P, sizeof(mb_bearssl_suites_server_ec_P) / sizeof(mb_bearssl_suites_server_ec_P[0]));
    br_ssl_server_set_single_ec(ssl_server_ctx.get(), chain ? chain->getX509Certs() : nullptr, chain ? chain->getCount() : 0, sk ? sk->getEC() : nullptr, BR_KEYTYPE_KEYX | BR_KEYTYPE_SIGN, cert_issuer_key_type, br_ssl_engine_get_ec(eng), br_ecdsa_i15_sign_asn1);
    br_ssl_engine_set_buffers_bidi(eng, ssl_iobuf_in.get(), ssl_iobuf_in_size, ssl_iobuf_out.get(), ssl_iobuf_out_size);
    br_ssl_engine_set_versions(eng, tls_version_min, tls_version_max);
    if (cache != nullptr)
        br_ssl_server_set_cache(ssl_server_ctx.get(), cache->getCache());
    if (client_CA_ta && !m_installServerX509Validator(client_CA_ta))
    {
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerEC: Can't install serverX509check\n");
        return false;
    }
    if (!br_ssl_server_reset(ssl_server_ctx.get()))
    {
        m_freeSSL();
        MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerEC: Can't reset server ctx\n");
        return false;
    }

    return m_wait_for_handshake();
#else
    (void)chain;
    (void)cert_issuer_key_type;
    (void)sk;
    (void)cache;
    (void)client_CA_ta;
    MB_ESP8266_SSLCLIENT_DEBUG_PRINTF("m_connectSSLServerEC: Attempting to use EC cert in minimal cipher mode (no EC)\n");
    return false;
#endif
}

//  Set up the x509 insecure data structures for BearSSL core to use.
void ESP8266_SSL_Client::m_br_x509_insecure_init(mb_br_x509_insecure_context *ctx, int _use_fingerprint, const uint8_t _fingerprint[20], int _allow_self_signed)
{
    static const br_x509_class br_x509_insecure_vtable PROGMEM = {
        sizeof(mb_br_x509_insecure_context),
        mb_insecure_start_chain,
        mb_insecure_start_cert,
        mb_insecure_append,
        mb_insecure_end_cert,
        mb_insecure_end_chain,
        mb_insecure_get_pkey};

    memset(ctx, 0, sizeof *ctx);
    ctx->vtable = &br_x509_insecure_vtable;
    ctx->done_cert = false;
    ctx->match_fingerprint = nullptr;
    ctx->allow_self_signed = 0;
}

void ESP8266_SSL_Client::setTimeout(unsigned long timeout)
{
    this->timeout = timeout;
    if (base_client)
        base_client->setTimeout(timeout);
}

